<?php
//問題1
// 以下をfor文を使用して表示してください。

// 1
// 21
// 321


$ten = 10;
$sum = 0;
for($x = 0; $x < 3; $x++) {
    $sum = (($x + 1) * $ten**$x) + $sum ;
    echo $sum . "<br>";
}
?>

<br>

<?php
//問題2
// 以下をfor文を使用して表示してください。

//123
//456
//789
for ($x=1; $x<10; $x+=3) {
    for ($y=$x; $y<$x+3;$y++) 
    echo $y;
    echo "<br>";
    }
?>

<br>

<?php
//問題3
// 以下をfor文を使用して表示してください。

// 112
// 212
// 312
for($x = 1 ; $x <= 3 ; $x++){
    echo $x;
    for($y = 1 ; $y <= 2 ; $y ++){
      echo $y;
    }
    echo "<br>";
  }


?>

<br>

<?php
//問題4
// 以下をfor文を使用して表示してください。
//***1
//**121
//*12321
//1234321
for($a = 1 ; $a <= 4  ; $a ++){
    for($b = 3 ; $b >= $a ; $b --){
        echo "*";
      }
      for($c = 1 ; $c <=$a ; $c++){
        echo $c;
      }
      for($d = 3 ; $d >=6-$c ; $d--){
        echo $d-(4-$a);
      }
      echo "<br>";
  }
?>

<br>

<?php
//問題5
//以下をfor⽂を使⽤して表⽰してください。

//1234321
//*12321
//**121
//***1

for($a = 4 ; $a >= 1 ; $a--){
    for($b = 3 ; $b >= $a ; $b--){
        echo "*";
    }
    for($c = 1 ; $c <= $a ; $c++){
        echo $c;
    }
    for($d = $c-2 ; $d >= 1 ; $d--){
        echo $d;
    }
    echo "<br>";
}
?>

<br>

<?php
//問題6
//以下をfor⽂を使⽤して表⽰してください。

//****5
//***545
//**54345
//*5432345
//543212345

for($a = 5 ; $a >= 1 ; $a--){
    for($b = 2 ; $b <= $a ; $b++){
        echo "*";
    }
    for($c = 5 ; $c >= $a ; $c--){
        echo $c;
    }
    for($d = $c+2 ;$d <= 5 ; $d++){
        echo $d;
    }
    echo"<br>";
}
?>

<br>

<?php
//問題7
//以下をfor⽂を使⽤して表⽰してください。
//ヒント: if〜elseifを使⽤

//****1
//***121
//**12321
//*1234321
//123454321
//*1234321
//**12321
//***121
//****1

for($a = 1 ; $a <= 9 ; $a ++){
    if($a <= 5){
        for($b = 4 ; $b >= $a ; $b--){
            echo"*";
        }
        for($c = 1 ; $c <= $a ; $c++){
            echo$c;
        }
        for($d = $c-2 ; $d >= 1 ; $d--){
            echo$d;
        }
        echo"<br>";
    }
    else if($a >= 6){
        for($e = 6 ; $e <= $a ; $e++){
            echo"*";
        }
        for($f = 1 ; $f <= 10-$a ; $f++){
            echo$f;
        }
        for($g = $f-2 ; $g >= 1 ; $g--){
            echo$g;
        }
        echo"<br>";
    }
}

?>



